import { IStructure } from './aps-structure-id.component';

export const structureList: IStructure[] = [{
    unit: { name: 'Технологическая установка' },
    list: [
        {
            id: '0',
            title: 'Справочник',
            unitType: 1
        },
        {
            id: '1',
            title: 'Режимы работы ТУ',
            unitType: 2
        },
        {
            id: '2',
            title: 'Скорость изменнеия загрузки',
            unitType: 3
        }
        ,
        {
            id: '3',
            title: 'Диапазон производительности по регламенту',
            unitType: 4
        },
        {
            id: '4',
            title: 'Диапазон производительности по PIMS',
            unitType: 5
        },
        {
            id: '5',
            title: 'Плановая производительность (PIMS)',
            unitType: 6
        },
        {
            id: '6',
            title: 'Плановый расход топлива (PIMS)',
            unitType: 7
        }
        ,
        {
            id: '7',
            title: 'Инженерная модель',
        }
    ]
},
    {
        unit: { name: 'Материальный поток' },
        list: [
            {
                id: '8',
                title: 'Справочник',
            },
            {
                id: '9',
                title: 'Режимы работы ТУ',
            },
            {
                id: '10',
                title: 'Скорость изменнеия загрузки',
            }
            ,
            {
                id: '11',
                title: 'Диапазон производительности по регламенту',
            },
            {
                id: '12',
                title: 'Диапазон производительности по PIMS',
            },
            {
                id: '13',
                title: 'Плановая производительность (PIMS)',
            },
            {
                id: '14',
                title: 'Плановый расход топлива (PIMS)',
            }
            ,
            {
                id: '15',
                title: 'Инженерная модель',
            }
        ]
    },
    {
        unit: { name: 'Резервуар' },
        list: [
            {
                id: '16',
                title: 'Справочник'
            },
            {
                id: '17',
                title: 'Режимы работы ТУ'
            },
            {
                id: '18',
                title: 'Скорость изменнеия загрузки'
            }
            ,
            {
                id: '19',
                title: 'Диапазон производительности по регламенту'
            },
            {
                id: '20',
                title: 'Диапазон производительности по PIMS'
            },
            {
                id: '21',
                title: 'Плановая производительность (PIMS)'
            },
            {
                id: '22',
                title: 'Плановый расход топлива (PIMS)'
            }
            ,
            {
                id: '23',
                title: 'Инженерная модель'
            }
        ]
    },
    {
        unit: { name: 'Логистические графики' },
        list: [
            {
                id: '24',
                title: 'Справочник'
            },
            {
                id: '25',
                title: 'Режимы работы ТУ'
            },
            {
                id: '26',
                title: 'Скорость изменнеия загрузки'
            }
            ,
            {
                id: '27',
                title: 'Диапазон производительности по регламенту'
            },
            {
                id: '28',
                title: 'Диапазон производительности по PIMS'
            },
            {
                id: '29',
                title: 'Плановая производительность (PIMS)'
            },
            {
                id: '30',
                title: 'Плановый расход топлива (PIMS)'
            }
            ,
            {
                id: '31',
                title: 'Инженерная модель'
            }
        ]
    },
    {
        unit: { name: 'Моделирование' },
        list: [
            {
                id: '32',
                title: 'Справочник'
            },
            {
                id: '33',
                title: 'Режимы работы ТУ'
            },
            {
                id: '34',
                title: 'Скорость изменнеия загрузки'
            }
            ,
            {
                id: '35',
                title: 'Диапазон производительности по регламенту'
            },
            {
                id: '36',
                title: 'Диапазон производительности по PIMS'
            },
            {
                id: '37',
                title: 'Плановая производительность (PIMS)'
            },
            {
                id: '38',
                title: 'Плановый расход топлива (PIMS)'
            }
            ,
            {
                id: '39',
                title: 'Инженерная модель'
            }
        ]
    },
    {
        unit: { name: 'Результат расчета' },
        list: [
        ]
    },
];
